{"modelTopology": {"backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "name": "input_1", "dtype": "float32", "sparse": false}}, {"name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "block1_conv1", "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "dtype": "float32", "filters": 64, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "activation": "relu", "bias_constraint": null}}, {"name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "block1_conv2", "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "dtype": "float32", "filters": 64, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "activation": "relu", "bias_constraint": null}}, {"name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "block1_pool", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "dtype": "float32"}}, {"name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "block2_conv1", "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "dtype": "float32", "filters": 128, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "activation": "relu", "bias_constraint": null}}, {"name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "block2_conv2", "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "dtype": "float32", "filters": 128, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "activation": "relu", "bias_constraint": null}}, {"name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "block2_pool", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "dtype": "float32"}}, {"name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "block3_conv1", "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "dtype": "float32", "filters": 256, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "activation": "relu", "bias_constraint": null}}, {"name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "block3_conv2", "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "dtype": "float32", "filters": 256, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "activation": "relu", "bias_constraint": null}}, {"name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "block3_conv3", "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "dtype": "float32", "filters": 256, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "activation": "relu", "bias_constraint": null}}, {"name": "block3_pool", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "block3_pool", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "dtype": "float32"}}, {"name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "block4_conv1", "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "dtype": "float32", "filters": 512, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "activation": "relu", "bias_constraint": null}}, {"name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "block4_conv2", "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "dtype": "float32", "filters": 512, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "activation": "relu", "bias_constraint": null}}, {"name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "block4_conv3", "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "dtype": "float32", "filters": 512, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "activation": "relu", "bias_constraint": null}}, {"name": "block4_pool", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "block4_pool", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "dtype": "float32"}}, {"name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "block5_conv1", "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "dtype": "float32", "filters": 512, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "activation": "relu", "bias_constraint": null}}, {"name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "block5_conv2", "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "dtype": "float32", "filters": 512, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "activation": "relu", "bias_constraint": null}}, {"name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"strides": [1, 1], "name": "block5_conv3", "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "dtype": "float32", "filters": 512, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "kernel_size": [3, 3], "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "activation": "relu", "bias_constraint": null}}, {"name": "block5_pool", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"name": "block5_pool", "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "strides": [2, 2], "dtype": "float32"}}], "name": "vgg16", "output_layers": [["block5_pool", 0, 0]]}}, "keras_version": "2.1.6-tf"}, "weightsManifest": [{"weights": [{"shape": [3, 3, 3, 64], "name": "block1_conv1/kernel", "dtype": "float32"}, {"shape": [64], "name": "block1_conv1/bias", "dtype": "float32"}, {"shape": [3, 3, 64, 64], "name": "block1_conv2/kernel", "dtype": "float32"}, {"shape": [64], "name": "block1_conv2/bias", "dtype": "float32"}, {"shape": [3, 3, 64, 128], "name": "block2_conv1/kernel", "dtype": "float32"}, {"shape": [128], "name": "block2_conv1/bias", "dtype": "float32"}, {"shape": [3, 3, 128, 128], "name": "block2_conv2/kernel", "dtype": "float32"}, {"shape": [128], "name": "block2_conv2/bias", "dtype": "float32"}, {"shape": [3, 3, 128, 256], "name": "block3_conv1/kernel", "dtype": "float32"}, {"shape": [256], "name": "block3_conv1/bias", "dtype": "float32"}, {"shape": [3, 3, 256, 256], "name": "block3_conv2/kernel", "dtype": "float32"}, {"shape": [256], "name": "block3_conv2/bias", "dtype": "float32"}, {"shape": [3, 3, 256, 256], "name": "block3_conv3/kernel", "dtype": "float32"}, {"shape": [256], "name": "block3_conv3/bias", "dtype": "float32"}, {"shape": [3, 3, 256, 512], "name": "block4_conv1/kernel", "dtype": "float32"}, {"shape": [512], "name": "block4_conv1/bias", "dtype": "float32"}, {"shape": [3, 3, 512, 512], "name": "block4_conv2/kernel", "dtype": "float32"}, {"shape": [512], "name": "block4_conv2/bias", "dtype": "float32"}, {"shape": [3, 3, 512, 512], "name": "block4_conv3/kernel", "dtype": "float32"}, {"shape": [512], "name": "block4_conv3/bias", "dtype": "float32"}, {"shape": [3, 3, 512, 512], "name": "block5_conv1/kernel", "dtype": "float32"}, {"shape": [512], "name": "block5_conv1/bias", "dtype": "float32"}, {"shape": [3, 3, 512, 512], "name": "block5_conv2/kernel", "dtype": "float32"}, {"shape": [512], "name": "block5_conv2/bias", "dtype": "float32"}, {"shape": [3, 3, 512, 512], "name": "block5_conv3/kernel", "dtype": "float32"}, {"shape": [512], "name": "block5_conv3/bias", "dtype": "float32"}], "paths": ["group1-shard1of15", "group1-shard2of15", "group1-shard3of15", "group1-shard4of15", "group1-shard5of15", "group1-shard6of15", "group1-shard7of15", "group1-shard8of15", "group1-shard9of15", "group1-shard10of15", "group1-shard11of15", "group1-shard12of15", "group1-shard13of15", "group1-shard14of15", "group1-shard15of15"]}]}